Tekla Open API Reference for Tekla Structures 2025
Assertion.MethodName Property
 Gets the name of the method the assertion failed in.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string MethodName { get; }
Public ReadOnly Property MethodName As String
	Get
Property Value
Type: String
See Also
Reference
Assertion Class
Tekla.Structures Namespace